@extends(ss('THEME') . '.frontend.layouts.intro.appnew_v2', [
'title' => l('گیلند ملک | املاک رضوانشهر و پره سر')])

@section('head')

<style>

</style>
@endsection

@section('main_content')
<main class="page-wrapper" style="background-color:#fff;">
    @include(ss('THEME') . '.frontend.layouts.header_rent')

    <section class="container mt-5 pt-5">
        <nav class="mb-3 pt-md-3 " aria-label="breadcrumb">
            <ol class="breadcrumb">
                <li class="breadcrumb-item"><a href="/">{{ l('خانه') }}</a></li>
                <li class="breadcrumb-item active" aria-current="page">{{ l('قوانین و مقررات') }}</li>
            </ol>
        </nav>
    </section>
    <section class=" bg-primary mb-3">
        <div class="container ">
            <p class="text-white py-4">
                {{ l('دوست عزیز، تمامی تلاش ما در نوشتن این متن ، استفاده بهتر شما از خدمات گیلند ملک است. به منظور آشنایی هرچه بیشتر حق و حقوق قانونی خود، لطفا موارد زیر را به‌دقت مطالعه کنید..') }}
            </p>
        </div>
    </section>
    <section class="container">
        <div class="mb-3">
            <h2 class="fw-bold mb-2 fs-5">{{ l('تعاریف و اصطلاحات') }}</h2>

            <ol class="ms-3">
                <li class="mb-2">
                    <b>{{ l('اقامتگاه:') }}</b> {{ l('به تمامی واحدهای اقامتی ثبت شده در گیلند ملک گفته می‌شود.') }}
                </li>
                <li class="mb-2">
                    <b>{{ l('مهمان(مسافر):') }}</b> {{ l('فرد یا افرادی که قصد اقامت در اقامتگاه را دارند و درخواست اقامت خود را از طریق گیلند ملک ثبت می‌کنند.') }}
                </li>
                <li class="mb-2">
                    <b>{{ l('میزبان:') }}</b> {{ l('شخصیتی حقیقی یا حقوقی است که اقامتگاه را به‌ازای درخواست اقامت مهمان از طریق گیلند ملک ، در اختیار ایشان قرار می‌دهد.') }}
                </li>
                <li class="mb-2">
                    <b>{{ l('مالک:') }}</b> {{ l('شخص حقیقی یا حقوقی که صاحب اقامتگاه است.') }}
                </li>
                <li class="mb-2">
                    <b>{{ l('نماینده مالک:') }}</b> {{ l('شخص حقیقی یا حقوقی که به‌صورت رسمی اجازه بهره‌برداری (اجاره) از اقامتگاه را داشته باشد و یا نماینده قانونی وی باشد.') }}
                </li>
                <li class="mb-2">
                    <b>{{ l('کاربر:') }}</b>{{ l('شخصی که با فناوری ارتباطی به وب‌سایت و یا اپلیکیشن گیلند ملک متصل و از خدمات نرم‌افزاری آن بهره‌مند می‌شود.') }}<br>
                    {{ l('قابل ذکر است: کاربر، میزبان، مالک و نماینده مالک می‌تواند یک نفر باشد.') }}
                </li>

                <li class="mb-2">
                    <b>{{ l('حساب کاربری:') }}</b> {{ l('حسابی که کاربران برای استفاده از خدمات گیلند ملک در آن ایجاد کرده‌اند.') }}
                </li>
                <li class="mb-2">
                    <b>{{ l('موجودی حساب (اعتبار):') }}</b> {{ l('مبلغی که مهمان در حساب کاربری خود جهت استفاده از خدمات گیلند ملک دارد.') }}
                </li>
                <li class="mb-2">
                    <b>{{ l('واچر:') }}</b> {{ l('به معنای تاییدیه رزرو اقامتگاه است و در واقع رسیدی است که پس از رزرو اقامتگاه از طرف گیلند ملک برای مهمان صادر می‌شود و نشان می‌دهد که مهمان هزینه اقامت خود را به‌صورت کامل پرداخت کرده است. این رسید شامل مشخصات اقامتگاه، تاریخ ورود و خروج، نام و شماره تماس مهمانان است.') }}
                </li>
                <li class="mb-2">
                    <b>{{ l('بلیط:') }}</b> {{ l('همانند واچر می باشد اما برای تجربه به عبارت دیگر تاییده رزرو انجام شده برای تجربه، بلیط است.') }}
                </li>

                <li class="mb-2">
                    <b>{{ l('اقامتگاه دربستی:') }}</b> {{ l('کلیه اقامتگاه هایی که به‌طور کامل و دربست در اختیار مهمان قرار می‌گیرد. مانند: ویلا، خانه، آپارتمان، کلبه و') }}
                </li>
                <li class="mb-2">
                    <b>{{ l('تجربه (اکسپرینس):') }}</b> {{ l('«تجربه» فعالیت‌هایی هستند که توسط افراد بومی در هر منطقه برنامه‌ریزی و اجرا می‌شوند. این فعالیت‌ها فراتر از تورها و برنامه‌های معمولی هستند که مهمانان را به دنیای منحصر به فردی می‌برند، دنیایی که مهمان به‌خودی خود نمی‌تواند آن را تجربه کند. «تجربه» فرصتی‌ست تا هرکس علائق، مهارت و یا تخصص خود را بدون وابستگی و بدون محدودیت منابع به اشتراک گذارد.') }}
                </li>
            </ol>
        </div>
        <div class="mb-3">
            <h2 class="fw-bold mb-2 fs-5">{{ l('قوانین و مقررات ثبت نام و استفاده از گیلند ملک') }}</h2>

            <p class="text-justify">
                {{ l('کاربر با ثبت نام در گیلند ملک می‌پذیرد که قوانین و مقررات گیلند ملک را به صورت کامل مطالعه کرده، به مفاد آن آگاه و تمامی موارد آن را پذیرفته است. در صورتی که در آینده در این قوانین و مقررات تغییراتی ایجاد شود، در همین صفحه به‌روزرسانی و منتشر می‌شود و کاربر توافق می‏‌کند که استفاده مستمر از سایت به‌معنی پذیرش هرگونه تغییر است.') }}<br>
                <br>
                {{ l('هر فرد تنها می‌تواند یک حساب کاربری به عنوان مهمان، یک حساب کاربری به عنوان میزبان و یا هردو به صورت همزمان در گیلند ملک داشته باشد.') }}<br><br>

                {{ l('مسئولیت تمامی فعالیت‌هایی که از طریق حساب کاربری اشخاص در گیلند ملک انجام می‌شود به عهده کاربر است.') }}<br>
                <br>
                {{ l('مسئولیت حفظ امنیت اطلاعات حساب کاربری از جمله نام کاربری و رمز عبور به عهده کاربر است. در صورت مفقود یا سرقت اطلاعات حساب کاربری، کاربر موظف است در اسرع وقت موضوع را به اطلاع کارشناسان گیلند ملک برساند. بدیهی است تا زمانی که اطلاع‌رسانی به گیلند ملک انجام نشده است مسئولیت همه فعالیت‌هایی که از طریق حساب کاربری مذکور انجام شده و می‌شود به عهده کاربر خواهد بود.') }}<br>
                <br>
                {{ l('در برخی شرایط ممکن است برای استفاده از خدمات، از کاربر درخواست احراز هویت شود، در چنین شرایطی اگر کاربر اطلاعات کافی را در اختیار گیلند ملک قرار ندهد، گیلند ملک می‌تواند حساب کاربری وی را مسدود کرده و از ارایه خدمات به وی خودداری کند.') }}<br>
                <br>
                {{ l('کاربر می‌پذیرد که گیلند ملک ارایه دهنده خدمات اقامتی نیست و تنها یک بستر نرم‌افزاری برای ارتباط میان میزبانان و مهمانان جهت توافق به انجام یک اقامت است.') }}<br>
                <br>
                {{ l('چنانچه گیلند ملک به هر دلیل به این نتیجه برسد که حضور یک کاربر (میزبان/مهمان) ممکن است برای مجموعه یا سایر کاربران مطلوب نباشد و یا موجب بروز مشکل شود، حق حذف دسترسی کاربر مذکور به گیلند ملک را دارد.') }}<br>
            </p>
        </div>
        <div class="mb-3">
            <h2 class="fw-bold mb-2 fs-5">{{ l('قوانین و مقررات عمومی') }}</h2>

            <p class="text-justify">
                {{ l('کلیه فرآیند های خرید در وب سایت منطبق با قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است و متعاقبا کاربر موظف به رعایت قوانین و مقررات وب سایت در هنگام خرید است.') }}<br>
                <br>
                {{ l('گیلند ملک می تواند در صورت افزودن قابلیت ها و خدمات جدید و یا در جهت بهبود عملکرد، اقدام به به روز رسانی ضوابط و مقررات وب سایت نماید.') }}<br>
                <br>
                {{ l('گیلند ملک تنها یک بستر ارتباطی میان میزبان و مهمان است و به عنوان مجری تجربه یا میزبان اقامتگاه و هتل محسوب نمی گردد. در گیلند ملک، میزبان تجربه و یا اقامتگاه خود را معرفی می نماید و مهمان نیز با آگاهی نسبت به فعالیت پلتفرم گیلند ملک اقدام به رزرو هتل، اقامتگاه و تجربه و پرداخت به صورت آنلاین می نماید. گیلند ملک در جهت بهبود ارایه خدمات خود نهایت تلاش خود را می نماید.') }} <br>
                <br>
                {{ l('اطلاعات هتل‌های ارایه شده در گیلند ملک ، به‌صورت مستقیم از منابع رسمی(هتل ها، مراکز اقامتی و …) دریافت شده است و اطلاعات سایر اقامتگاه‌ها توسط مالکان آن در گیلند ملک درج شده است. به‌علت تغییرات دوره‌ای این اطلاعات، تأیید صحت آنها برعهده همان منابع است. گیلند ملک تلاش می‌کند تا این تغییرات را در کمترین زمان ممکن به‌روزرسانی کند.') }}<br>
                <br>
                {{ l('اگر مالکیت هتل‌ها و سایر اقامتگاه‌ها با گیلند ملک بود، مطمئنا تمامی خدمات اعلام شده از طرف مراکز اقامتی و هتل را از لحاظ کیفیت و صحت تضمین می‌کرد، اما گیلند ملک صرفا به عنوان یک بستر الکترونیک نسبت به اعلام خدمات اقدام می نماید و می کوشد کلیه اطلاعاتی را که توسط میزبان و یا هتل اعلام می گردد، اعتبار سنجی و یا راستی آزمایی نماید. اطلاعات هتل، اقامتگاه در وب سایت گیلند ملک شامل وضعیت ظرفیت اتاق هتل یا اقامتگاه ، نقشه هتل ، قیمتهای به روز شده ، تصاویر هتل ها، عوارض و مالیات، حق سرویس، وعده های غذایی، امکانات هتل و ترانسفر فرودگاهی و… است حال ممکن است هتل ها و سایر اقامتگاه‌ها در مواردی در ارایه خدمات اعلامی کوتاهی کنند و یا کلیه یا برخی از اطلاعات مندرج در صفحه هتل، اقامتگاه یا تجربه گیلند ملک مطابق با اطلاعاتی که در زمان معرفی آن محصولات اعلام شده، نباشد. در این صورت مسئولیت ناشی از هرگونه نقض یا مغایرت ، با مالک هتل، اقامتگاه یا تجربه است در این‌صورت ما از شما می‌خواهیم تا این قبیل مشکلات را با مجموعه گیلند ملک درمیان بگذارید تا ضمن پیگیری، بازخورد آن را در اختیار سایر مسافرین قرار داده و در صورت لزوم، سرویس مذکور را از محصولات گیلند ملک حذف گردد.') }}<br>
                <br>
                {{ l('در روزهای پر مسافرِ سال، هتل ها و سایر اقامتگاه‌ها قوانین خاصی اجرا داشته باشند. از جمله ‎دارند تا بتوانند مدیریت بهتری در پذیرش و خدمات نا محدود به این قوانین می‌توان به عدم پذیرش کنسلی و در برخی هتل ها عدم ارایه سرویس‌های اتاق به‌صورت تخت اضافه اشاره کرد، گیلند ملک در این خصوص مسئولیتی نخواهد داشت.') }}<br>
                <br>
                {{ l('احراز هویت مهمان و شرایط محرمیت، از سوی اقامتگاه یا هتل و بر اساس ارزش ها و شئونات اسلامی است؛ اقامتگاه‌ها یا هتل ها این اختیار را خواهند داشت در صورت عدم احراز شرایط محرمیت از ورود مسافرین به اقامتگاه ممانعت کرده و مطابق قوانین کنسلی عمل می‌کنند.') }}<br>
                <br>
                {{ l('هنگامی که شما رزرو خود را کنسل می‌کنید، این ریسک برای اقامتگاه وجود دارد تا نتواند در زمان باقی مانده، واحد اقامتی خود را به فروش رساند. بنابراین منطقی است تا مبلغی را به‌عنوان جریمه‌ی استرداد از مهمان دریافت کند. سیاست صاحبان اقامتگاه‌ها در میزان این جریمه متفاوت است، از این‌رو قوانین کنسلی هر اقامتگاه، در صفحه آن اقامتگاه درج شده است و ممکن است با اقامتگاه دیگر متفاوت باشد. حتی ممکن است این قوانین در تمام سال یکسان نباشد. اطمینان داشته باشید ما تلاش می‌کنیم در صورت انصراف از رزرو، کمترین هزینه را بپردازید؛ برای همین از شما می‌خواهیم به محض انصراف ، گیلند ملک را از تصمیم خود مطلع کنید تا جریمه کمتری شوید. وجه مسترد شده به شماره حسابی که با آن از گیلند ملک خرید کرده اید، واریز خواهد شد.') }}<br>
                <br>
                {{ l('برای پذیرش بانوان که به‌صورت تنها قصد اقامت دارند قانوناً مشکلی وجود ندارد .‎ و با نامه رسمی شرکت ها و سازمان‌ها مأموریت و یا شرکت در همایش‌ها، اقامت به‌راحتی میسر می‌شود. اگر می‌خواهید مطمئن سفر کنید و خیالتان راحت باشد با ما تماس بگیرید.') }} <br>
                <br>
                {{ l('مهمان می‌پذیرد رزرو هر اقامتگاه یا هتل به معنای تأیید مقررات آن اقامتگاه یا هتل از سوی ایشان است و می بایست به ضوابط آن پایبند باشد.') }}<br>
                <br>
                {{ l('زمان ورود و خروج هر اقامتگاه در صفحه آن ذکر شده است. میزبان و مهمان متعهد به رعایت این زمانبندی هستند.') }}<br>
                <br>
                {{ l('مهمان می‌پذیرد چنانچه به واسطه اقامت ایشان، خسارتی به محل اقامت و وسایل آن وارد شود، مسئولیت تأمین هزینه‌های مربوط به آن بر عهده ایشان خواهد بود.') }}<br>
                <br>
                {{ l('رزرو خریداری شده، متعلق به مهمانی است که مشخصاتش هنگام ثبت سفارش وارد شده است، لذا غیر قابل انتقال به غیر است.') }}<br>
                <br>
                {{ l('در صورتی که در مدت زمان اقامت مهمان در یک اقامتگاه، عملی خلاف قوانین جمهوری اسلامی ایران انجام شود و مسئولیت آن با شخصی است که مرتکب جرم شده است ، گیلند ملک هیچگونه مسئولیتی در خصوص تخلفات یا جرایم صورت گرفته شده ندارد.') }}<br>
                <br>
                {{ l('در صورت درخواست لغو رزرو اقامتگاه یا هتل، مبلغ رزرو پس از اعمال قوانین کنسلی اقامتگاه یا هتل ، به شماره شبا، حساب یا کارت بانکی درج شده توسط کاربر در حساب کاربری ایشان واریز می‌شود. تمام تلاش گیلند ملک بر آن است تا عودت مبلغ در کمترین زمان ممکن صورت پذیرد، اما بنا به شرایط ممکن است این فرآیند تا ۴۸ ساعت کاری به‌طول انجامد.') }}<br>
                <br>
            </p>
        </div>
        <div class="mb-3">
            <h2 class="fw-bold mb-2 fs-5">{{ l('قوانین و مقررات اختصاصی رزرو هتل') }}</h2>

            <p class="text-justify">
                {{ l('با توجه به اینکه پس از خرید نهایی هتل امکان تغییر یا اصلاح نام و یا مشخصات مهمان وجود ندارد و جهت اصلاح اطلاعات، می بایست هتل کنسل شده و مجدداً رزرو از سوی مهمان صورت گیرد، لذا ارائه اطلاعات شخصی صحیح، نظیر نام و نام خانوادگی طبق اطلاعات شناسایی( اعم و نه محدود به شماره ملی،شماره پاسپورت، ملیت مسافر، تعداد مسافرین، جنسیت و سن مهمان و … بر عهده مهمان می باشد.') }}<br>
                <br>
                {{ l('هتل خریداری شده، متعلق به مهمانی است که مشخصات خود را در سیستم وارد کرده و غیر قابل انتقال به غیر می‌باشد. و اگر مشخصات واچر با مشخصات مدارک شناسایی مهمان مطابقت نداشته باشد مهمان پذیرش نخواهد شد.') }}<br>
                <br>
                {{ l('تغییر تاریخ در رزو انجام شده مقدور تیست و در این خصوص می بایست رزو جدید با شرایط و مبالغ جدید صورت گیرد.') }}<br>
                <br>
                {{ l('کنسل کردن واچر هتل یا کنسلی اقامتگاه ها توسط مهمان از طریق گیلند ملک ممکن است مشمول جریمه کنسلی گردد. مقدار جریمه و شرایط کنسلی در هر هتل، اقامتگاه یا وب سایت متفاوت است. مبلغ جریمه و شرایط کنسلی در هنگام هر رزرو به مهمان اطلاع داده خواهد شد. این مسئله در خصوص هتل ها یا اقامتگاه هایی که جریمه آنها ۱۰۰% در گیلند ملک قید شده صادق نیست و هزینه‌ی این هتل یا اقامتگاه ها در صورت کنسلی به طور کامل دریافت می‌شود.') }} <br>
                <br>
                {{ l('ممکن است حین خرید و پرداخت وجه هتل، ظرفیت هتل منتخب تکمیل شود. اگر این اتفاق پس از پرداخت وجه از سوی کاربر صورت گیرد ، مبلغ به حساب کاربری ایشان عودت داده خواهد شدو می تواند مجددا برای خرید هتل اقدام نماید. کسر مبلغ از حساب به منزله اخذ قطعی واچر هتل نبوده و در صورت انصراف از خرید، مبلغ به همان حسابی که از طریق آن خرید انجام شده است عودت داده خواهد شد.') }}<br>
                <br>
                {{ l('در صورت تحویل اتاق دیرتر از موعد مقرر توسط هتل ، هیچ مبلغی به مهمان عودت داده نخواهد شد و گیلند ملک در این خصوص هیچگونه مسئولیتی نخواهد داشت.') }}<br>
                <br>
                {{ l('رزرو هتل فقط شامل رزرو اتاق به تعداد افراد و شبهای درخواست شده می باشد و دربرگیرنده مواردی همچون حمل و نقل فرودگاهی، حمل و نقل بین شهری، راهنما، تعیین طبقه، پارکینگ و یا اجاره ی خودرو و… نیست و همچنین مینی بار و صندوق امانات در اکثر هتل ها شامل هزینه اضافه بوده که به عهده مهمان است و در صورت ایجاد خسارت به هتل توسط مهمان، کلیه خسارت ها از مهمان دریافت خواهد شد.') }}<br>
                <br>
                {{ l('زمان پذیرش مهمان در هتل ( Check In) عموما ساعت ۱۴:۰۰ است. پس از ورود به هتل، در صورت خروج از هتل زودتر از موعد ثبت شده در واچر، وجهی بابت عدم استفاده از اتاق به مهمان مسترد نمی گردد.') }}<br>
                <br>
                {{ l('در خصوص خرید گروهی در شرایط عادی (غیر اضطراری) فقط شخصی که به نمایندگی از سوی مهمان اقدام به ثبت نام و خرید نموده مجاز به مراجعه به گیلند ملک جهت پیگیری، ابطال و یا دریافت وجوه پرداختی بوده و سایر مهمانان در این خصوص مجاز به مراجعه به گیلند ملک برای این امر نمی باشند.') }}<br>
                <br>
                {{ l('اگر کاربر درخواست هایی همچون اتاق با دو تخت یک نفره، یا اتاق دارای امکان استفاده از دخانیات ، ورود زودتر یا دیرتر از موعد و مواردی از این قبیل را داشته باشد، گیلند ملک به هتل منتقل می کند و تایید نهایی در این خصوص با هتل است و گیلند ملک در این خصوص هیچگونه مسئولیتی نخواهد داشت.') }}<br>
                <br>
                {{ l('قابل ذکر است طبق قوانین اکثر هتل‌ها، افراد بالای ۴ سال بزرگسال محسوب می‌گردند و می‌بایست هنگام رزرو اتاق برای آنان تخت درنظر گرفته شود، در صورت عدم رعایت این موضوع ممکن است هتل از ورود تعداد افراد بیش از ظرفیت رزرو شده ممانعت بعمل آورد. گیلند ملک هیچگونه مسئولیتی در این خصوص نخواهد داشت. در صورت نیاز به تخت برای کودک در هر سنی زمان خرید، نیز همچون مورد قبل باید کودک را بزرگسال انتخاب نموده و اطمینان حاصل فرمایید نوع اتاق منتخب ظرفیت کل تعداد نفرات در یک اتاق را دارا باشد، در صورت عدم رعایت این موضوع زمان پذیرش هزینه نفر اضافه مستقیما توسط مهمان در هتل پرداخت می گردد و هیچ نوع مسئولیتی در این خصوص متوجه گیلند ملک نخواهد بود.') }}<br>
                <br>
                {{ l('در صورتیکه هتل به هر دلیلی، امکان پذیرش مهمان با وجود واچر معتبر را نداشته باشد، مهمان باید با واحد پشتیبانی شبانه روزی گیلند ملک با شماره 09300755673 تماس گرفته تا در کمترین زمان مشکل حل شود و یا در صورت عدم پذیرش مهمان توسط هتل منتخب ، هتل مناسب دیگری مشابه هتل منتخب مهمان که از طرف تامین کننده پیشنهاد شده است برای مهمان جایگزین گردد. در صورت عدم پذیرش هتل پیشنهادی توسط مهمان، مبلغ اخذ شده بابت آن رزرو را به مهمان استرداد می کند و گیلند ملک دیگر هیچ مسئولیتی در قبال آن رزرو ندارد.') }}<br>
                <br>
                {{ l('پس از پرداخت مبلغ رزرواسیون هتل و قطعی شدن آن، واچر برای کاربر صادر در حساب کاربری منتشر و به ایمیل کاربر ارسال می گردد. ارایه واچر هتل به همراه مدارک شناسایی از سوی مهمان به مسئول پذیرش هتل الزامی است.. با توجه به شرایط هتل، رزرو اتاق های سه تخته ممکن است شامل یک اتاق دو تخته همراه با تخت اضافه(Extra bed) بوده و یا سه تخت استاندارد است و نیز سایز اتاق ها و انتخاب طبقه اتاق ها بستگی به ظرفیت هتل در زمان پذیرش مهمان دارد.') }}<br>
                <br>
                {{ l('با انجام رزرو از سوی کاربر و تایید آن از سوی هتل، مهمان مقررات مربوط به هتل منتخب و همچنین قوانین مربوط به فسخ رزرو را نیز پذیرفته است. به عبارت دیگر مهمان با آگاهی و اطلاع کافی از مقررات گیلند ملک و اعلامی از سوی هتل، نسبت به رزرو اقدام نموده است در قراردادهای آنلاین طبق قانون تجارت الکترونیک امضای مهمان به صورت الکترونیک انجام میشود.') }}<br>
                <br>
            </p>
        </div>

        <div class="mb-3">
            <h2 class="fw-bold mb-2 fs-5">{{ l('قوانین و مقررات اختصاصی رزرو اقامتگاه‌های دربستی') }}</h2>
            <p class="text-justify">
                {{ l('مهمان و میزبان می‌پذیرند که فرآیند رزرو و تایید یا رد آن در گیلندملک تنها از طریق ارسال پیام کوتاه (SMS) و ایمیل (به شماره و ایمیل درج شده در هنگام ثبت نام) است. لذا مسئولیت عدم دریافت پیام کوتاه یا ایمیل به‌دلیل عدم دسترسی به اینترنت، ضعف آنتن‌دهی موبایل و یا درج اطلاعات اشتباه هنگام ثبت نام برعهده کاربر است.') }}<br>
                <br>
                {{ l('واریز مبلغ توسط مهمان به معنای رزرو قطعی محسوب نشده و تنها پس از تایید توسط میزبان و صدور واچر از طرف گیلند ملک، رزرو و خرید قطعی شده تلقی می‌شود. در این حالت اطلاعات رزرو و اطلاعات تماس میزبان و مهمان از طریق پیام کوتاه و ایمیل به آنها ارسال می‌شود و می‌توانند هماهنگی‌های لازم را با هم به عمل آورند. و در صورت عدم تایید نهایی رزرو، مبلغ واریز شده توسط مهمان طی مدت 48.ساعت به ایشان عودت داده خواهد شد. مهمان متعهد می‌شود که تعداد همراهان مراجعه کننده به اقامتگاه جهت اقامت، دقیقاً مطابق تعداد اعلام شده در درخواست رزرو باشد، در غیر این صورت، پذیرش نفر اضافه منوط به تأیید میزبان و هزینه آن بر عهده مهمان است. گیلند ملک نیز هیچگونه مسئولیتی در خصوص پیگیری افزودن تعداد همراهان مهمان نخواهد داشت.') }}<br>
                <br>
                {{ l('مهمان متعهد است قوانین اشاره شده توسط میزبان در استفاده از اقامتگاه احترام گذارد و اجرا نماید در غیر اینصورت مسئولیت نقض قواعد برعهده مهمان است و گیلند ملک در این خصوص مسئولیتی نخواهد داشت. به طور مثال در صورتی که میزبان ورود حیوانات خانگی را ممنوع اعلام کرده باشد و مهمان آن شرایط را رعایت ننماید، مسئولیت اتفاقات رخ داده با مهمان است.') }}<br>
                <br>
                {{ l('مهمان متعهد است مطابق تعداد نفراتی که هنگام رزرو انتخاب کرده به اقامتگاه مراجعه کند، در غیر اینصورت مسئولیت نقض قواعد برعهده مهمان است و گیلند ملک و میزبان در این خصوص مسئولیتی نخواهند داشت. به طور مثال در صورتی که مهمان هنگام رزرو تعداد نفرات را ۴ نفر انتخاب کرده باشد و هنگام مراجعه بیش از ۴ نفر باشند، مسئولیت اتفاقات رخ داده با مهمان است و میزبان می‌تواند مهمان را پذیرش نکند.') }}<br>
                <br>
                {{ l('میزبان می‌پذیرد که قیمت درج شده در گیلند ملک نهایی است و اخذ هرگونه هزینه اضافه از مهمان تحت هر عنوان اعم از حق کمیسیون، پورسانت، حق دلالی و غیره، مجاز نیست. در غیر این‌صورت، اقامتگاه و نام کاربری وی حذف می‌شود. ارایه خدمات اضافه بر آنچه که در صفحه اقامتگاه درج شده است، خارج از تعهد مذبور است و منوط به توافق با مهمان است.') }}<br>
                <br>
                {{ l('میزبان می‌تواند درخواست اقامت را بپذیرد و یا رد کند. در صورتی که میزبان درخواست اقامتی را پذیرفت، متعهد به ارایه خدمات براساس آن درخواست است در غیر این‌صورت خسارات وارده به مهمان و گیلند ملک و عواقب ناشی از آن بر عهده میزبان است.') }}<br>
                <br>
                {{ l('مهمان می پذیرد هرگونه تغییر در جزییات رزرو را با هماهنگی گیلند ملک انجام دهد و از هرگونه توافق مستقیم با میزبان که مطابق اطلاعات رزرو نباشد، خودداری نماید. هرگونه واریز وجه نیز به مهمان به صورت مستقیم ممنوع است و گیلند ملک تنها مسئول پیگیری تراکنش هایی است که از طریق سایت گیلند ملک صورت می گیرد.') }}<br>
                <br>
                {{ l('میزبان متعهد می‌شود در صورت عدم مراجعه مهمان به اقامتگاه در تاریخ رزرو شده، اقامتگاه تا پایان مدت رزرو شده، برای مهمان خالی خواهد ماند، همچنین مهمان می‌پذیرد که در این شرایط هیچ‌ مبلغی به وی مسترد نخواهد شد. (در صورت درخواست لغو رزرو توسط مهمان، مطابق قوانین کنسلی آن اقامتگاه رفتار می‌شود.)') }}
                <br>
            </p>
        </div>
        <div class="mb-3">
            <h2 class="fw-bold mb-2 fs-5">{{ l('قوانین و مقررات اختصاصی رزرو تجربه (اکسپرینس)') }}</h2>

            <p class="text-justify">
                {{ l('گیلند ملک پلتفرمی جهت نمایش اطلاعات تجربه طبق اطلاعات اعلامی میزبان است در صورت مغایرت در اطلاعات وارد شده گیلند ملک هیچگونه مسئولیتی نخواهد داشت.') }}<br>
                <br>
                {{ l('تجربه به عنوان یک پلتفرم در بستر اینترنت جهت خلق تجربه شایسته سفر است.') }}<br>
                <br>
                {{ l('نحوه تعامل مهمان با میزبان جهت خلق یک تجربه به نحوه ارتباط بین آنان بستگی دارد. گیلند ملک این اختیار را به میزبان داده است که در وب سایت و اعلام تجربه به معرفی خود پرداخته و مهمان با آشنایی نسبت به میزبان نسبت به پذیرش تجربه جدید اقدام نماید. گیلند ملک نهایت تلاش خود را در خصوص بررسی نحوه فعالیت میزبان و ارایه تجربه بعمل می آورد. با توجه به اینکه گیلند ملک یک پلتفرم جهت شناساندن تجربه های جدید است، مجری یا نماینده میزبان محسوب نمی شود و هیچگونه مسئولیتی در خصوص صحت تجربه میزبان به مهمان ارایه نداده و به مهمان اختیار می دهد تا در خصوص همراهی با میزبان تصمیم گیری نماید. در صورتی که از سوی مهمان اعلام گردد که میزبان خارج از تعهدات خود عمل نموده و یا شونات مذهبی، قانونی و اخلاقی را رعایت ننموده نسبت به قطع دسترسی میزبان اقدام می نماید.') }}<br>
                <br>
                {{ l('میزبان متعهد هست که تجربه را عینا مطابق آنچه در وب سایت اعلام نموده ارایه دهد، در غیر اینصورت در صورت اعلام مهمان یا احراز آن توسط گیلند ملک ، به میزبان اخطارداده خواهد شد و در مواردی به تشخیص گیلند ملک برسد دسترسی میزبان قطع خواهد شد.') }}<br>
                <br>
                {{ l('مهمان می بایست فرهنگ بومی، هنجارهای جامعه میزبان اعم از فرهنگ، سنن، زبان، گویش، لباس، عقاید و… را ارج نهاده و به عقاید میزبان احترام گذارد. مهمان می بایست پوشش مناسب را در تجربه ها رعایت نموده و از انجام اعمالی که در عرف و قانون ممنوع یا غیراخلاقی است پرهیز کنید در غیر این صورت گیلند ملک هیچگونه مسولیتی دراین خصوص نخواهد داشت و می تواند نسبت به قطع دسترسی مهمان در خصوص رزرو های آتی تجربه اقدام نماید.') }}<br>
                <br>
                {{ l('حضور افراد زیر ۱۸ سال در تمامی برنامه‌های تجربه منوط به همراهی و یا اجازه کتبی سرپرست فرد می‌باشد.') }}<br>
                <br>
                {{ l('مهمان می بایست قبل از شروع تجربه به ضوابط و تجربیات اعلامی از سوی میزبان توجه نموده و لوازم ضروری و پیشنهادی سفر و کسب سایر اطلاعات کافی در خصوص سفر را از میزبان جویا شود.') }}<br>
                <br>
                {{ l('کنسلی هر تجربه توسط مهمان به شرایط تعیین شده از سوی میزبان بستگی دارد. مهمان همزمان با رزرو یک تجربه تمامی شرایط اعلامی از سوی گیلند ملک و میزبان را می پذیرد و با آگاهی کامل در خصوص رزرو تجربه اقدام می نماید.') }}<br>
                <br>
                {{ l('مهمان متعهد است قوانین اشاره شده توسط میزبان در استفاده از تجربه احترام گذارد و اجرا نماید در غیر اینصورت مسئولیت نقض قواعد برعهده مهمان است و گیلند ملک در این خصوص مسئولیتی نخواهد داشت. به طور مثال در صورتی که میزبان شرایط سنی مشخصی را برای تجربه در نظر گرفته و مهمان آن شرایط را رعایت ننماید، مسئولیت اتفاقات رخ داده با مهمان است.') }}
                <br>
            </p>

        </div>
        <div class="mb-3">
            <h2 class="fw-bold mb-2 fs-5">{{ l('تعهدات گیلند ملک') }}</h2>

            <p class="text-justify">
                {{ l('گیلند ملک تضمین می‌کند تا با تکمیل فرآیند خرید از سوی کاربر و دریافت نامه اقامت (واچر) ، بتوانید به راحتی در هتل و یا اقامتگاه مورد نظر، پذیرش شده و از امکانات آن بهره‌مند شوید. در مواردی نادر ممکن است به دلایل مختلف از جمله مشکلات اعلام شده از طرف اقامتگاه نظیر خرابی‌ها و حوادث طبیعی، اشتباهات انسانی همچون اشتباه فاحش در مبلغ اعلامی و همچنین موارد امنیتی مانند ورود مقامات بلندپایه، رزرو ثبت شده با مشکل مواجهه شود، در این‌گونه موارد گیلند ملک تمام تلاش خود را می‌کند تا برای مهمانان خود، هتل و یا اقامتگاهی مشابه با واحد رزرو شده فعلی در نظر گیرد و درصورت عدم موفقیت در جلب رضایت مهمان (مسافر)، مبلغ را به‌صورت کامل بازگرداند و امتیاز ویژه ای را برای رزرو آتی وی منظور کند.') }} <br>
                <br>
                {{ l('حفظ و نگهداری از رمز عبور بر عهده کاربران است و برای جلوگیری از هر گونه سوء استفاده احتمالی، کاربران نباید آن را برای شخص دیگری افشاء نمایند .تمامی اطلاعات کاربران نزد گیلند ملک محرمانه تلقی می‌شود و گیلند ملک متعهد می‌شود این اطلاعات را در اختیار شخص دیگر قرار ندهد، مگر در مواقعی که این اطلاعات از جانب مقامات قضایی ذیصلاح با داشتن حکم قانونی درخواست شود.') }}<br>
                <br>
                {{ l('در صورت بروز مشکلات احتمالی بین میزبان و مهمان، تیم گیلند ملک تمامی تلاش خود را جهت برطرف نمودن مشکلات به عمل خواهد آورد.') }}<br>
                <br>
                {{ l('تیم گیلند ملک برای شما دوست عزیز سفر خوب همراه با لذت و شادی را آرزومند است.') }}

            </p>

        </div>
    </section>

    @include(ss('THEME') . '.frontend.layouts.footer_rent', ['cssClass' => 'intro'])
</main>
@endsection

@section('js')

@endsection