<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

class EstateType extends Model
{
    /**
     *
     * این کلاس مورد بررسی قرار گیرد تا درصورت عدم نیاز حذف شود
     *
     */
    public static function getFields($estateType,$type)
    {
        // sale
        if($type == 1){
            $arr[1] = [
                'conditions' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'ندارد',
                        'پیش فروش',
                        'قابل معاوضه',
                        'وام دار',
                        'مجتمع/ برج',
                        'قدرالسهمی',]
                ],
                'document_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شش دانگ',
                        'سرقفلی',
                        'مشاع',
                        'اوقافی',
                        'مسکن مهر',
                        'وکالتی',
                        'قولنامه ای',
                        'بنیادی',
                        'زمین شهری',
                        'شورایی',
                        'در دست اقدام',]
                ],
                'structure_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'فلزی',
                        'بتنی',
                        'بتنی – فلزی',
                        'غیره',]
                ],
                'facilities' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'پارکینگ',
                        'انباری',
                        'آسانسور',
                        'سالن پرده خور',
                        'استخر',
                        'سونا',
                        'جکوزی',
                        'پرده',
                        'کاغذ دیواری',
                        'کف سرامیک',
                        'کف پارکت',
                        'کف لمینت',
                        'کف سنگ',
                        'کف موزاییک',
                        'کف موکت',
                        'درب ضد سرقت',
                        'درب ضد حریق',
                        'کمد دیواری',
                        'لابی',
                        'نگهبانی',
                        'سرایداری',
                        'لابی من',
                        'سالن اجتماعات',
                        'سالن ورزشی',
                        'پنجره دوجداره',
                        'پاسیو',
                        'باربکیو',
                        'بالکن (فضای آزاد سقف دار)',
                        'تراس (فضای آزاد بدون سقف)',
                        'آیفون تصویری',
                        'شوتینگ زباله',
                        'جاروبرقی مرکزی',
                        'آنتن مرکزی',
                        'آسانسور باربری',
                        'آسانسور خودروبر',
                        'روف گاردن',
                        'درب ریموت دار',
                        'آلاچیق',
                        'دوربین مدار بسته',]
                ],
                'kitchen' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'هود',
                        'گاز صفحه ای',
                        'آب شیرین کن',
                        'فضای ماشین ظرفشویی',
                        'فضای ماشین لباسشویی',
                        'MDF',
                        'ممبران',
                        'فلزی',
                        'چوب',
                        'فلز و MDF',
                        'مطبخ',
                        'کابینت ندارد',]
                ],
                'heating_cooling' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'بخاری',
                        'رادیات',
                        'پکیج',
                        'فن کوئل',
                        'چیلر',
                        'مینی چیلر',
                        'کولر گازی',
                        'داکت اسپیلت',
                        'کولر آبی',
                        'موتورخانه مرکزی',
                        'شومینه',
                        'گرمایش از کف',
                        'هواساز',
                        'VRF',
                        'GHP',
                        'آب گرمکن ایستاده',
                        'آب گرمکن',
                        'سایر',]
                ],
                'wc' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'ایرانی',
                        'فرنگی',
                        'ایرانی-فرنگی',]
                ],
                'usage_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'مسکونی',
                        'اداری',
                        'تجاری',
                        'مسکونی با موقعیت اداری - تجاری',
                        'گردشگری',
                        'غیره',]
                ],
                'geography' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شمالی',
                        'جنوبی',
                        'شرقی',
                        'غربی',
                        'دوبر',
                        'سه بر',
                        'چهاربر',
                        'دوکله',]
                ],
                'floor' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        '-1' => 'زیرهمکف',
                        '0' => 'همکف',
                        '1' => '1',
                        '2' => '2',
                        '3' => '3',
                        '4' => '4',
                        '5' => '5',
                        '6' => '6',
                        '7' => '7',
                        '8' => '8',
                        '9' => '9',
                        '10' => '10',
                        '11' => '11',
                        '12' => '12',
                        '13' => '13',
                        '14' => '14',
                        '15' => '15',
                        '16' => '16',
                        '17' => '17',
                        '18' => '18',
                        '19' => '19',
                        '20' => '20',
                        '21' => '21',
                        '22' => '22',
                        '23' => '23',
                        '24' => '24',
                        '25' => '25',
                        '26' => '26',
                        '27' => '27',
                        '28' => '28',
                        '29' => '29',
                        '30' => '30',
                        '31' => 'بیشتر از 30',
                        '32' => 'پنت هاوس',
                    ]
                ],
                'floor_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        '1',
                        '2',
                        '3',
                        '4',
                        '5',
                        '6',
                        '7',
                        '8',
                        '9',
                        '10',
                        '11',
                        '12',
                        '13',
                        '14',
                        '15',
                        '16',
                        '17',
                        '18',
                        '19',
                        '20',
                        '21',
                        '22',
                        '23',
                        '24',
                        '25',
                        '26',
                        '27',
                        '28',
                        '29',
                        '30',
                        'بیشتر از 30',]
                ],
                'room_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بدون اتاق',
                        '1',
                        '2',
                        '3',
                        '4',
                        'بیشتر از 4',]
                ],
                'built_year' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'کلید نخورده',
                        '1400',
                        '1399',
                        '1398',
                        '1397',
                        '1396',
                        '1395',
                        '1394',
                        '1393',
                        '1392',
                        '1391',
                        '1390',
                        '1389',
                        '1388',
                        '1387',
                        '1386',
                        '1385',
                        '1384',
                        '1383',
                        '1382',
                        '1381',
                        '1380',
                        '1379',
                        '1378',
                        '1377',
                        '1376',
                        '1375',
                        '1374',
                        '1373',
                        '1372',
                        '1371',
                        '1370',
                        '1369',
                        '1368',
                        '1367',
                        '1366',
                        '1365',
                        '1364',
                        '1363',
                        '1362',
                        '1361',
                        '1360',
                        'قبل از 1360',]
                ],
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',]
                ],
                'sale_reason' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سرمایه گذاری',
                        'نیاز به نقدینگی',
                        'تبدیل و جابجایی',]
                ],
                'sale_priority' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'زیاد',
                        'متوسط',
                        'کم',]
                ],
                'residence_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سکونت مالک',
                        'سکونت مستاجر',
                        'تخلیه',]
                ],
            ];
            $arr[2] = [
                'conditions' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'ندارد',
                        'پیش فروش',
                        'قابل معاوضه',
                        'وام دار',
                        'مشارکت در ساخت',
                        'کلنگی',
                    ]
                ],
                'document_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شش دانگ',
                        'سرقفلی',
                        'مشاع',
                        'اوقافی',
                        'مسکن مهر',
                        'وکالتی',
                        'قولنامه ای',
                        'بنیادی',
                        'زمین شهری',
                        'شورایی',
                        'در دست اقدام',
                    ]
                ],
                'structure_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'فلزی',
                        'بتنی',
                        'بتنی – فلزی',
                        'غیره',
                    ]
                ],
                'facilities' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'پارکینگ',
                        'انباری',
                        'آسانسور',
                        'سالن پرده خور',
                        'استخر',
                        'سونا',
                        'جکوزی',
                        'پرده',
                        'کاغذ دیواری',
                        'کف سرامیک',
                        'کف پارکت',
                        'کف لمینت',
                        'کف سنگ',
                        'کف موزاییک',
                        'کف موکت',
                        'درب ضد سرقت',
                        'درب ضد حریق',
                        'کمد دیواری',
                        'لابی',
                        'نگهبانی',
                        'سرایداری',
                        'لابی من',
                        'سالن اجتماعات',
                        'سالن ورزشی',
                        'پنجره دوجداره',
                        'پاسیو',
                        'باربکیو',
                        'بالکن (فضای آزاد سقف دار)',
                        'تراس (فضای آزاد بدون سقف)',
                        'آیفون تصویری',
                        'شوتینگ زباله',
                        'جاروبرقی مرکزی',
                        'آنتن مرکزی',
                        'آسانسور باربری',
                        'آسانسور خودروبر',
                        'روف گاردن',
                        'درب ریموت دار',
                        'آلاچیق',
                        'دوربین مدار بسته',
                    ]
                ],
                'kitchen' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'هود',
                        'گاز صفحه ای',
                        'آب شیرین کن',
                        'فضای ماشین ظرفشویی',
                        'فضای ماشین لباسشویی',
                        'MDF',
                        'ممبران',
                        'فلزی',
                        'چوب',
                        'فلز و MDF',
                        'مطبخ',
                        'کابینت ندارد',
                    ]
                ],
                'heating_cooling' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'بخاری',
                        'رادیات',
                        'پکیج',
                        'فن کوئل',
                        'چیلر',
                        'مینی چیلر',
                        'کولر گازی',
                        'داکت اسپیلت',
                        'کولر آبی',
                        'موتورخانه مرکزی',
                        'شومینه',
                        'گرمایش از کف',
                        'هواساز',
                        'VRF',
                        'GHP',
                        'آب گرمکن ایستاده',
                        'آب گرمکن',
                    ]
                ],
                'wc' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'ایرانی',
                        'فرنگی',
                        'ایرانی-فرنگی',
                    ]
                ],
                'usage_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'مسکونی',
                        'اداری',
                        'تجاری',
                        'مسکونی با موقعیت اداری',
                        'مسکونی به همراه تجاری',
                        'گردشگری',
                        'باغ ویلا',
                        'ویلا جنگلی',
                        'ویلا ساحلی',
                    ]
                ],
                'geography' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شمالی',
                        'جنوبی',
                        'شرقی',
                        'غربی',
                        'دوبر',
                        'سه بر',
                        'چهاربر',
                        'دوکله',
                    ]
                ],
                'floor_start' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'زیرزمین',
                        'همکف',
                        'پیلوت بدون سوئیت',
                        'پیلوت با سوئیت',
                    ]
                ],
                'floor_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        '1',
                        '2',
                        '3',
                        '4',
                        '5',
                        '6',
                        '7',
                        '8',
                        '9',
                        '10',
                        '11',
                        '12',
                        '13',
                        '14',
                        '15',
                        '16',
                        '17',
                        '18',
                        '19',
                        '20',
                        '21',
                        '22',
                        '23',
                        '24',
                        '25',
                        '26',
                        '27',
                        '28',
                        '29',
                        '30',
                        'بیشتر از 30',
                    ]
                ],
                'room_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بدون اتاق',
                        '1',
                        '2',
                        '3',
                        '4',
                        'بیشتر از 4',
                    ]
                ],
                'built_year' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'کلید نخورده',
                        '1400',
                        '1399',
                        '1398',
                        '1397',
                        '1396',
                        '1395',
                        '1394',
                        '1393',
                        '1392',
                        '1391',
                        '1390',
                        '1389',
                        '1388',
                        '1387',
                        '1386',
                        '1385',
                        '1384',
                        '1383',
                        '1382',
                        '1381',
                        '1380',
                        '1379',
                        '1378',
                        '1377',
                        '1376',
                        '1375',
                        '1374',
                        '1373',
                        '1372',
                        '1371',
                        '1370',
                        '1369',
                        '1368',
                        '1367',
                        '1366',
                        '1365',
                        '1364',
                        '1363',
                        '1362',
                        '1361',
                        '1360',
                        'قبل از 1360',
                    ]
                ],
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',
                    ]
                ],
                'sale_reason' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سرمایه گذاری',
                        'نیاز به نقدینگی',
                        'تبدیل و جابجایی',
                    ]
                ],
                'sale_priority' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'زیاد',
                        'متوسط',
                        'کم',
                    ]
                ],
                'residence_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سکونت مالک',
                        'سکونت مستاجر',
                        'تخلیه',
                    ]
                ],
            ];
            $arr[3] = [
                'conditions' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'ندارد',
                        'پیش فروش',
                        'قابل معاوضه',
                        'وام دار',
                        'مجتمع تجاری',
                        'غرفه',
                    ]
                ],
                'room_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بدون اتاق',
                        '1',
                        '2',
                        '3',
                        '4',
                        'بیشتر از 4',
                    ]
                ],
                'floor_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        '1',
                        '2',
                        '3',
                        '4',
                        '5',
                        '6',
                        '7',
                        '8',
                        '9',
                        '10',
                        '11',
                        '12',
                        '13',
                        '14',
                        '15',
                        '16',
                        '17',
                        '18',
                        '19',
                        '20',
                        '21',
                        '22',
                        '23',
                        '24',
                        '25',
                        '26',
                        '27',
                        '28',
                        '29',
                        '30',
                        'بیشتر از 30',
                    ]
                ],
                'floor_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'دارای زیرزمین',
                        'دارای بالکن',
                    ]
                ],
                'document_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شش دانگ',
                        'سرقفلی',
                        'مشاع',
                        'اوقافی',
                        'وکالتی',
                        'قولنامه ای',
                        'بنیادی',
                        'در دست اقدام',
                    ]
                ],
                'position_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بر خیابان اصلی',
                        'داخل کوچه',
                        'کنار جاده',
                        'دور میدان',
                        'داخل بازار',
                        'داخل مجتمع تجاری',
                        'داخل شهرک صنعتی',
                        'سایر',
                    ]
                ],
                'geography' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'یک بر',
                        'دو بر',
                        'سه بر',
                        'چهار بر',
                        'دوکله',
                    ]
                ],
                'heating_cooling' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'بخاری',
                        'رادیات',
                        'پکیج',
                        'فن کوئل',
                        'چیلر',
                        'مینی چیلر',
                        'کولر گازی',
                        'داکت اسپیلت',
                        'کولر آبی',
                        'موتورخانه مرکزی',
                        'گرمایش از کف',
                        'هواساز',
                        'VRF',
                        'GHP',
                        'آب گرمکن ایستاده',
                        'آب گرمکن',
                    ]
                ],
                'wc' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'ایرانی',
                        'فرنگی',
                        'ایرانی-فرنگی',
                    ]
                ],
                'facilities' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'پارکینگ',
                        'انباری',
                        'آسانسور',
                        'بالابر',
                        'کاغذ دیواری',
                        'کف سرامیک',
                        'کف پارکت',
                        'کف لمینت',
                        'کف سنگ',
                        'کف موزاییک',
                        'لابی',
                        'نگهبانی',
                        'سرایداری',
                        'لابی من',
                        'سالن اجتماعات',
                        'شیشه سکوریت',
                        'شوتینگ زباله',
                        'جاروبرقی مرکزی',
                        'آنتن مرکزی',
                        'آسانسور باربری',
                        'آسانسور خودروبر',
                        'روف گاردن',
                        'کرکره برقی',
                        'درب اتوماتیک',
                        'دوربین مدار بسته',
                        'دزدگیر',
                    ]
                ],
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',
                    ]
                ],
                'sale_reason' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سرمایه گذاری',
                        'نیاز به نقدینگی',
                        'تبدیل و جابجایی',
                    ]
                ],
                'sale_priority' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'زیاد',
                        'متوسط',
                        'کم',
                    ]
                ],
                'residence_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سکونت مالک',
                        'سکونت مستاجر',
                        'تخلیه',
                    ]
                ],
            ];
            $arr[4] = [
                'conditions' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'ندارد',
                        'قابل معاوضه',
                        'تمایل به مشارکت در ساخت',
                    ]
                ],
                'document_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شش دانگ',
                        'مشاع',
                        'اوقافی',
                        'وکالتی',
                        'قولنامه ای',
                        'بنیادی',
                        'زمین شهری',
                        'شورایی',
                        'قراداد واگذاری',
                        'در دست اقدام',
                    ]
                ],
                'usage_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'مسکونی',
                        'اداری',
                        'تجاری',
                        'گردشگری',
                        'کشاورزی',
                        'باغ',
                        'دامپروری',
                        'صنعتی',
                        'بایر',
                    ]
                ],
                'build_license' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'دارد',
                        'ندارد',
                    ]
                ],
                'geography' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شمالی',
                        'جنوبی',
                        'شرقی',
                        'غربی',
                        'دوبر',
                        'سه بر',
                        'چهاربر',
                        'دوکله',
                    ]
                ],
                'position_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بر خیابان اصلی',
                        'داخل کوچه',
                        'کنار جاده',
                        'دور میدان',
                        'داخل بازار',
                        'ساحلی',
                        'جنگلی',
                        'داخل محدوده شهری',
                        'خارج محدوده شهری',
                        'داخل شهرک صنعتی',
                    ]
                ],
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',
                    ]
                ],
                'sale_reason' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سرمایه گذاری',
                        'نیاز به نقدینگی',
                        'تبدیل و جابجایی',
                    ]
                ],
                'sale_priority' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'زیاد',
                        'متوسط',
                        'کم',
                    ]
                ],
            ];
            $arr[5] = [
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',
                    ]
                ],
                'sale_reason' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سرمایه گذاری',
                        'نیاز به نقدینگی',
                        'تبدیل و جابجایی',
                    ]
                ],
                'sale_priority' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'زیاد',
                        'متوسط',
                        'کم',
                    ]
                ],
            ];

            return $arr[$estateType];
        }

        // rent
        if($type == 2){
            $arr[1] = [
                'rent_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => ['یک ساله', 'کوتاه مدت']
                ],
                'convertible' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => ['دارد', 'ندارد']
                ],
                'usage_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'مسکونی',
                        'اداری',
                        'تجاری',
                        'مسکونی با موقعیت اداری - تجاری',
                        'گردشگری',
                    ]
                ],
                'conditions' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'ندارد',
                        'مناسب مجرد',
                        'مخصوص سکونت خانواده',
                        'مناسب مطب و دفتر کار',
                        'اتاق اداری',
                        'کلید نخورده',
                    ]
                ],
                'room_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بدون اتاق',
                        '1',
                        '2',
                        '3',
                        '4',
                        'بیشتر از 4',
                    ]
                ],
                'unit_in_floor' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        '1',
                        '2',
                        '3',
                        '4',
                        '5',
                        '6',
                        '7',
                        '8',
                        '9',
                        '10',
                        '11',
                        '12',
                        '13',
                        '14',
                        '15',
                        '16',
                        '17',
                        '18',
                        '19',
                        '20',
                        '21',
                        '22',
                        '23',
                        '24',
                        '25',
                        '26',
                        '27',
                        '28',
                        '29',
                        '30',
                        'بیشتر از 30',
                    ]
                ],
                'floor' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        '-1' => 'زیرهمکف',
                        '0' => 'همکف',
                        '1' => '1',
                        '2' => '2',
                        '3' => '3',
                        '4' => '4',
                        '5' => '5',
                        '6' => '6',
                        '7' => '7',
                        '8' => '8',
                        '9' => '9',
                        '10' => '10',
                        '11' => '11',
                        '12' => '12',
                        '13' => '13',
                        '14' => '14',
                        '15' => '15',
                        '16' => '16',
                        '17' => '17',
                        '18' => '18',
                        '19' => '19',
                        '20' => '20',
                        '21' => '21',
                        '22' => '22',
                        '23' => '23',
                        '24' => '24',
                        '25' => '25',
                        '26' => '26',
                        '27' => '27',
                        '28' => '28',
                        '29' => '29',
                        '30' => '30',
                        '31' => 'بیشتر از 30',
                        '32' => 'پنت هاوس',
                    ]
                ],
                'geography' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شمالی',
                        'جنوبی',
                        'شرقی',
                        'غربی',
                        'دوبر',
                        'سه بر',
                        'چهاربر',
                        'دوکله',
                    ]
                ],
                'kitchen' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'هود',
                        'گاز صفحه ای',
                        'آب شیرین کن',
                        'فضای ماشین ظرفشویی',
                        'فضای ماشین لباسشویی',
                        'MDF',
                        'ممبران',
                        'فلزی',
                        'چوب',
                        'فلز و MDF',
                        'مطبخ',
                        'کابینت ندارد',
                    ]
                ],
                'heating_cooling' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'بخاری',
                        'رادیات',
                        'پکیج',
                        'فن کوئل',
                        'چیلر',
                        'مینی چیلر',
                        'کولر گازی',
                        'داکت اسپیلت',
                        'کولر آبی',
                        'موتورخانه مرکزی',
                        'شومینه',
                        'گرمایش از کف',
                        'هواساز',
                        'VRF',
                        'GHP',
                        'آب گرمکن ایستاده',
                        'آب گرمکن',
                    ]
                ],
                'wc' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'ایرانی',
                        'فرنگی',
                        'ایرانی-فرنگی',
                    ]
                ],
                'facilities' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'پارکینگ',
                        'انباری',
                        'آسانسور',
                        'استخر',
                        'سونا',
                        'جکوزی',
                        'پرده',
                        'کاغذ دیواری',
                        'کف سرامیک',
                        'کف پارکت',
                        'کف لمینت',
                        'کف سنگ',
                        'کف موزاییک',
                        'کف موکت',
                        'درب ضد سرقت',
                        'درب ضد حریق',
                        'کمد دیواری',
                        'لابی',
                        'نگهبانی',
                        'سرایداری',
                        'لابی من',
                        'سالن اجتماعات',
                        'سالن ورزشی',
                        'پنجره دوجداره',
                        'پاسیو',
                        'باربکیو',
                        'بالکن',
                        'آیفون تصویری',
                        'شوتینگ زباله',
                        'جاروبرقی مرکزی',
                        'آنتن مرکزی',
                        'آسانسور باربری',
                        'آسانسور خودروبر',
                        'روف گاردن',
                        'درب ریموت دار',
                        'آلاچیق',
                        'دوربین مدار بسته',
                    ]
                ],
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',
                    ]
                ],
                'residence_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سکونت مالک',
                        'سکونت مستاجر',
                        'تخلیه',
                    ]
                ],
            ];
            $arr[2] = [
                'rent_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => ['یک ساله', 'کوتاه مدت']
                ],
                'convertible' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => ['دارد', 'ندارد']
                ],
                'room_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بدون اتاق',
                        '1',
                        '2',
                        '3',
                        '4',
                        'بیشتر از 4',
                    ]
                ],
                'floor_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        '1',
                        '2',
                        '3',
                        '4',
                        '5',
                        '6',
                        '7',
                        '8',
                        '9',
                        '10',
                        '11',
                        '12',
                        '13',
                        '14',
                        '15',
                        '16',
                        '17',
                        '18',
                        '19',
                        '20',
                        '21',
                        '22',
                        '23',
                        '24',
                        '25',
                        '26',
                        '27',
                        '28',
                        '29',
                        '30',
                        'بیشتر از 30',
                    ]
                ],
                'floor_start' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'زیرزمین',
                        'همکف',
                        'پیلوت بدون سوئیت',
                        'پیلوت با سوئیت',
                    ]
                ],
                'usage_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'مسکونی',
                        'اداری',
                        'تجاری',
                        'مسکونی با موقعیت اداری',
                        'مسکونی به همراه تجاری',
                        'گردشگری ( اقامتی)',
                        'باغ ویلا',
                        'ویلا جنگلی',
                        'ویلا ساحلی',
                    ]
                ],
                'conditions' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'ندارد',
                        'مناسب مجرد',
                        'اجاره کوتاه مدت',
                        'مخصوص سکونت خانواده',
                        'مناسب مطب و دفتر کار',
                        'دربست',
                        'درب مجزا',
                        'کلید نخورده',
                    ]
                ],
                'geography' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شمالی',
                        'جنوبی',
                        'شرقی',
                        'غربی',
                        'دوبر',
                        'سه بر',
                        'چهاربر',
                        'دوکله',
                    ]
                ],
                'kitchen' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'هود',
                        'گاز صفحه ای',
                        'آب شیرین کن',
                        'فضای ماشین ظرفشویی',
                        'فضای ماشین لباسشویی',
                        'MDF',
                        'ممبران',
                        'فلزی',
                        'چوب',
                        'فلز و MDF',
                        'مطبخ',
                        'کابینت ندارد',
                    ]
                ],
                'heating_cooling' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'بخاری',
                        'رادیات',
                        'پکیج',
                        'فن کوئل',
                        'چیلر',
                        'مینی چیلر',
                        'کولر گازی',
                        'داکت اسپیلت',
                        'کولر آبی',
                        'موتورخانه مرکزی',
                        'شومینه',
                        'گرمایش از کف',
                        'هواساز',
                        'VRF',
                        'GHP',
                        'آب گرمکن ایستاده',
                        'آب گرمکن',
                    ]
                ],
                'wc' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'ایرانی',
                        'فرنگی',
                        'ایرانی-فرنگی',
                    ]
                ],
                'facilities' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'پارکینگ',
                        'انباری',
                        'آسانسور',
                        'استخر',
                        'سونا',
                        'جکوزی',
                        'پرده',
                        'کاغذ دیواری',
                        'کف سرامیک',
                        'کف پارکت',
                        'کف لمینت',
                        'کف سنگ',
                        'کف موزاییک',
                        'کف موکت',
                        'درب ضد سرقت',
                        'درب ضد حریق',
                        'کمد دیواری',
                        'لابی',
                        'نگهبانی',
                        'سرایداری',
                        'لابی من',
                        'سالن اجتماعات',
                        'سالن ورزشی',
                        'پنجره دوجداره',
                        'پاسیو',
                        'باربکیو',
                        'بالکن',
                        'آیفون تصویری',
                        'شوتینگ زباله',
                        'جاروبرقی مرکزی',
                        'آنتن مرکزی',
                        'آسانسور باربری',
                        'آسانسور خودروبر',
                        'روف گاردن',
                        'درب ریموت دار',
                        'آلاچیق',
                        'دوربین مدار بسته',
                    ]
                ],
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',
                    ]
                ],
                'residence_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سکونت مالک',
                        'سکونت مستاجر',
                        'تخلیه',
                    ]
                ],
            ];
            $arr[3] = [
                'conditions' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'ندارد',
                        'مجتمع تجاری',
                        'غرفه',
                    ]
                ],
                'room_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بدون اتاق',
                        '1',
                        '2',
                        '3',
                        '4',
                        'بیشتر از 4',
                    ]
                ],
                'floor_count' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        '1',
                        '2',
                        '3',
                        '4',
                        '5',
                        '6',
                        '7',
                        '8',
                        '9',
                        '10',
                        '11',
                        '12',
                        '13',
                        '14',
                        '15',
                        '16',
                        '17',
                        '18',
                        '19',
                        '20',
                        '21',
                        '22',
                        '23',
                        '24',
                        '25',
                        '26',
                        '27',
                        '28',
                        '29',
                        '30',
                        'بیشتر از 30',
                    ]
                ],
                'floor_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'دارای زیرزمین',
                        'دارای بالکن',
                    ]
                ],
                'geography' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'دو بر',
                        'سه بر',
                        'دوکله',
                    ]
                ],
                'position_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بر خیابان اصلی',
                        'داخل کوچه',
                        'کنار جاده',
                        'دور میدان',
                        'داخل بازار',
                        'داخل مجتمع تجاری',
                        'داخل شهرک صنعتی',
                        'سایر',

                    ]
                ],
                'heating_cooling' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'بخاری',
                        'رادیات',
                        'پکیج',
                        'فن کوئل',
                        'چیلر',
                        'مینی چیلر',
                        'کولر گازی',
                        'داکت اسپیلت',
                        'کولر آبی',
                        'موتورخانه مرکزی',
                        'شومینه',
                        'گرمایش از کف',
                        'هواساز',
                        'VRF',
                        'GHP',
                        'آب گرمکن ایستاده',
                        'آب گرمکن',
                    ]
                ],
                'wc' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'ایرانی',
                        'فرنگی',
                        'ایرانی-فرنگی',
                    ]
                ],
                'facilities' => [
                    'multiple' => 'multiple',
                    'required' => 'required',
                    'values' => [
                        'پارکینگ',
                        'انباری',
                        'آسانسور',
                        'بالابر',
                        'کاغذ دیواری',
                        'کف سرامیک',
                        'کف پارکت',
                        'کف لمینت',
                        'کف سنگ',
                        'کف موزاییک',
                        'لابی',
                        'نگهبانی',
                        'سرایداری',
                        'لابی من',
                        'سالن اجتماعات',
                        'شیشه سکوریت',
                        'شوتینگ زباله',
                        'جاروبرقی مرکزی',
                        'آنتن مرکزی',
                        'آسانسور باربری',
                        'آسانسور خودروبر',
                        'روف گاردن',
                        'درب ریموت دار',
                        'آلاچیق',
                        'دوربین مدار بسته',
                    ]
                ],
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',
                    ]
                ],
                'residence_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سکونت مالک',
                        'سکونت مستاجر',
                        'تخلیه',
                    ]
                ],
            ];
            $arr[4] = [
                'document_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شش دانگ',
                        'مشاع',
                        'اوقافی',
                        'وکالتی',
                        'قولنامه ای',
                        'بنیادی',
                        'زمین شهری',
                        'شورایی',
                        'قراداد واگذاری',
                        'در دست اقدام',
                    ]
                ],
                'usage_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'مسکونی',
                        'اداری',
                        'تجاری',
                        'گردشگری',
                        'کشاورزی',
                        'باغ',
                        'دامپروری',
                        'صنعتی',
                        'بدون توافق',
                    ]
                ],
                'build_license' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'دارد',
                        'ندارد',
                    ]
                ],
                'geography' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'شمالی',
                        'جنوبی',
                        'شرقی',
                        'غربی',
                        'دوبر',
                        'سه بر',
                        'چهاربر',
                        'دوکله',
                    ]
                ],
                'position_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'بر خیابان اصلی',
                        'داخل کوچه',
                        'کنار جاده',
                        'دور میدان',
                        'داخل بازار',
                        'ساحلی',
                        'جنگلی',
                        'داخل محدوده شهری',
                        'خارج محدوده شهری',
                        'داخل شهرک صنعتی',
                    ]
                ],
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',
                    ]
                ],
            ];
            $arr[5] = [
                'acquaintance_type' => [
                    'multiple' => '',
                    'required' => 'required',
                    'values' => [
                        'سایت '.ss('SITE_NAME'),
                        'شبکه های اجتماعی',
                        'معرفی دیگران',
                        'تبلیغات آنلاین',
                        'موتورهای جستجو',
                        'غیره',
                    ]
                ],
            ];

            return $arr[$estateType];
        }

        return null;
    }
}
